In [1]:
import numpy as np
import pandas as pd

In [2]:
L = [1,2,3,5]
pd.Series(L)

0    1
1    2
2    3
3    5
dtype: int64

In [3]:
pd.Series(L, index=['a','b','c','d'])

a    1
b    2
c    3
d    5
dtype: int64

In [4]:
L = {'a':1, 'b':2, 'c':3, 'd':4}
pd.Series(L)

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
S = pd.Series(L, index = ['a', 'b', 'c', 'd','e','f','g'])

In [6]:
S['c']

3.0

In [7]:
S['g'] =100
S

a      1.0
b      2.0
c      3.0
d      4.0
e      NaN
f      NaN
g    100.0
dtype: float64

In [8]:
S.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

In [9]:
S.values

array([  1.,   2.,   3.,   4.,  nan,  nan, 100.])

In [10]:
raw_data = {
    'first_name':['jason','molly','tina','jake','any'],
    'last_name':['miller','jacobson','ali','milner','cooze'],
    'age':[42,52,36,24,75],
    'city':['san francisco','baltimore','miami','douglas','boston']
}

raw_data

{'first_name': ['jason', 'molly', 'tina', 'jake', 'any'],
 'last_name': ['miller', 'jacobson', 'ali', 'milner', 'cooze'],
 'age': [42, 52, 36, 24, 75],
 'city': ['san francisco', 'baltimore', 'miami', 'douglas', 'boston']}

In [11]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [12]:
pd.DataFrame(raw_data, columns = ['last_name', 'first_name'])

  last_name first_name
0    miller      jason
1  jacobson      molly
2       ali       tina
3    milner       jake
4     cooze        any

In [13]:
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [14]:
df['first_name']

0    jason
1    molly
2     tina
3     jake
4      any
Name: first_name, dtype: object

In [16]:
df[['age','city']]

   age           city
0   42  san francisco
1   52      baltimore
2   36          miami
3   24        douglas
4   75         boston

In [17]:
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [18]:
df.index = ['a','b','c','d','e']

In [20]:
df.loc['e']

first_name       any
last_name      cooze
age               75
city          boston
Name: e, dtype: object

In [21]:
df.iloc[2]

first_name     tina
last_name       ali
age              36
city          miami
Name: c, dtype: object

In [22]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [23]:
df.loc[['b','c']]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

In [24]:
df.iloc[[1,2]]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami

In [25]:
df.iloc[[1,2,3],[1,2]]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [26]:
df.iloc[[1,2,3],[1,2]]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [27]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [30]:
df.iloc[1:4, 1:3]

  last_name  age
b  jacobson   52
c       ali   36
d    milner   24

In [31]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [33]:
df.loc[:,'first_name':'age']

  first_name last_name  age
a      jason    miller   42
b      molly  jacobson   52
c       tina       ali   36
d       jake    milner   24
e        any     cooze   75

In [34]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [37]:
df.loc[['a','b'], ['last_name', 'age']]

  last_name  age
a    miller   42
b  jacobson   52

In [38]:
df.iloc[[0,1],[0,1]]

  first_name last_name
a      jason    miller
b      molly  jacobson

In [39]:
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [40]:
df.loc[['b','c'],['last_name','age','city']]

  last_name  age       city
b  jacobson   52  baltimore
c       ali   36      miami

In [41]:
df.iloc[[1,2],[1,2,3]]

  last_name  age       city
b  jacobson   52  baltimore
c       ali   36      miami

In [42]:
df.iloc[[1,2],1:3]

  last_name  age
b  jacobson   52
c       ali   36

In [43]:
df.loc[['b','c'], 'first_name':'age']

  first_name last_name  age
b      molly  jacobson   52
c       tina       ali   36